<?php

use Carbon\Carbon;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades;

class SpecialtySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = $this->getData();
        foreach ($data as $index) {
            Facades\DB::table('specialties')->insert($index);
        }

        $this->setData();
    }

    /**
     * @return array
     */
    public function getData()
    {
        return [
            [
                'parent_id' => null,
                'type_id' => 1,
                'name' => 'ԲԺՇԿԱԿԱՆ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 2,
                'name' => 'ՍՏՈՄԱՏՈԼՈԳԻԱԿԱՆ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 3,
                'name' => 'ԴԵՂԱԳԻՏԱԿԱՆ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 4,
                'name' => 'ՀԱՆՐԱՅԻՆ ԱՌՈՂՋԱՊԱՀԱԿԱՆ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 1,
                'name' => 'ԲԺՇԿԱԿԱՆ ՆԵՂ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐԻ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 2,
                'name' => 'ՍՏՈՄԱՏՈԼՈԳԻԱԿԱՆ ՆԵՂ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 3,
                'name' => 'ԴԵՂԱԳԻՏԱԿԱՆ ՆԵՂ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'parent_id' => null,
                'type_id' => 4,
                'name' => 'ՀԱՆՐԱՅԻՆ ԱՌՈՂՋԱՊԱՀԱԿԱՆ ՆԵՂ ՄԱՍՆԱԳԻՏՈՒԹՅՈՒՆՆԵՐ',
                'icon' => 'fa ',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ]
        ];
    }

    public function setData()
    {

        $spec = [
            [1 => ['Ընտանեկան բժշկություն', 'Ներքին հիվանդություններ (թերապիա)', 'Մանկաբուժություն', 'Նյարդաբանություն','Հոգեբուժություն և բժշկական հոգեբանություն','Սրտաբանություն','Մաշկաբանություն և վեներոլոգիա','Ընդհանուր վիրաբուժություն','Վնասվածքաբանություն և օրթոպեդիկ վիրաբուժություն','Ուռուցքաբանություն','Ակնաբանություն','Քիթ-կոկորդ-ականջաբանություն','Մանկաբարձություն և գինեկոլոգիա','Շտապ և անհետաձգելի բժշկություն','Անեսթեզիոլոգիա և ինտենսիվ թերապիա','Ֆիզիկական և վերականգնողական բժշկություն','Բժշկական ախտորոշիչ ճառագայթաբանություն','Արյունաբանություն, տրանսֆուզիոն բժշկություն և արյան պաշարում','Կլինիկական ախտաբանություն','Թոքաբանություն և տուբերկուլյոզ','Ինֆեկցիոն հիվանդություններ','Ուռոլոգիա','Նյարդավիրաբուժություն','Պլաստիկ և վերակառուցողական վիրաբուժություն','Սրտանոթային վիրաբուժություն','Կլինիկական լաբորատոր ախտորոշում','Էնդոկրինոլոգիա','Մանկական վիրաբուժություն','Ալերգոլոգիա և իմունոլոգիա','Հերիատրիա','Հոմեոպաթիա','Սեռախտաբանություն','Երիկամաբանություն և հեմոդիալիզ','Աղեստամոքսաբանություն','Ռևմատոլոգիա','Կլինիկական դիետոլոգիա և նուտրիցիոլոգիա','Մասնագիտական ախտաբանություն (պրոֆպաթոլոգիա)','Ավիացիոն բժշկություն','Կլինիկական դեղաբանություն','Նեոնատոլոգիա','Մանկական ալերգոլոգիա և իմունոլոգիա','Մանկական ռեանիմացիա և ինտենսիվ թերապիա','Մանկական թոքաբանություն','Մանկական սրտաբանություն','Մանկական երիկամաբանություն','Մանկական ներզատաբանություն','Մանկական աղեստամոքսաբանություն և սնուցում',  'Մանկական ռևմատոլոգիա','Մանկական ինֆեկցիոն հիվանդություններ','Զարգացման մանկաբուժություն','Դեռահասային բժշկություն','Մանկական նյարդաբանություն','Երեխաների և դեռահասների հոգեբուժություն','Թմրաբանություն','Հոգեթերապիա','Դատահոգեբուժական փորձաքննություն','Կլինիկական հոգեբանություն','Ինտերվենցիոն սրտաբանություն','Ինտենսիվ սրտաբանություն և կարդիոռեանիմացիա','Բժշկական կոսմետոլոգիա','Մանկական վնասվածքաբանություն և օրթոպեդիա','Վիրաբուժական ուռուցքաբանություն (օնկովիրաբուժություն)','Ճառագայթային ուռուցքաբանություն','Հակաուռուցքային քիմիոթերապիա','Մանկական ակնաբանություն','Սուրդոլոգիա','Մանկական քիթ-կոկորդ-ականջաբանություն','Պերինատոլոգիա','Վերարտադրողական բժշկություն (ռեպրոդուկտոլոգիա)','Էնդոկրին գինեկոլոգիա','Մանկական գինեկոլոգիա','Ցավի կառավարում','Ամոքիչ (պալիատիվ) բժշկություն','Սպորտային բժշկություն','Ֆիզիոթերապիա','Մանուալ թերապիա','Ռեֆլեքսոթերապիա','Կինեզոթերապիա','Բալնեոթերապիա (ջրաբուժություն)','Բարոթերապիա','Ռենտգենաբանական ախտորոշում','Ուլտրաձայնային ախտորոշում (սոնոգրաֆիա)','Ինտենսիվ թերապիա','Մանկական անէսթեզիոլոգիա','Բժշկական թունաբանություն','Բժշկական գենետիկա','Մանկական մաշկաբանություն','Որովայնային վիրաբուժություն','Կրծքային վիրաբուժություն','Դիմածնոտային վիրաբուժություն','Կոլոռեկտալ վիրաբուժություն (պրոկտոլոգիա)','Էնդոկրին վիրաբուժություն', 'Այրվածքաբանություն','Կոմպյուտերային տոմոգրաֆիկ և միջուկամագնիսային-ռեզոնանսային ախտորոշում','Ռադիոնուկլիդային ախտորոշում (միջուկային բժշկություն)','Ինտերվենցիոն ճառագայթաբանություն','Ճառագայթային բժշկություն','Մանկական արյունաբանություն և ուռուցքաբանություն','Ախտաբանական անատոմիա և կլինիկական մորֆոլոգիա','Դատաբժշկական փորձաքննություն','Ախտաբանական ֆիզիոլոգիա','Ֆթիզիատրիա','Մանկական ուռոլոգիա','Անոթանյարդավիրաբուժություն','Մանկական և նորածնային նյարդավիրաբուժություն','Էսթետիկ վիրաբուժություն','Սրտային վիրաբուժություն','Անոթային վիրաբուժություն','Կլինիկական կենսաքիմիա','Լաբորատոր արյունաբանություն','Լաբորատոր թունաբանություն','Լաբորատոր գենետիկա','Կլինիկական բջջաբանություն','Լաբորատոր իմունոլոգիա (շճաբանություն)','Կլինիկական լաբորատոր կենսաբանություն']],
            [2 => ['Ընդհանուր (ընտանեկան) ստոմատոլոգիա','Վիրաբուժական ստոմատոլոգիա և իմպլանտոլոգիա','Օրթոդոնտիա','Օրթոպեդիկ ստոմատոլոգիա','Մանկական ստոմատոլոգիա','Էնդոդոնտոլոգիա','Մուկալոգիա','Վերականգնողական ստոմատոլոգիա','Պարոդոնտոլոգիա'
]],
            [3 => ['Ընդհանուր դեղագիտություն']],
            [4 => ['Հանրային առողջապահություն և կանխարգելիչ բժշկություն','Առողջապահության կառավարում և կազմակերպում','Շրջակա միջավայրի հիգիենա','Համաճարակաբանություն','Մանրէաբանություն','Վիրուսաբանություն','Սնկաբանություն','Մակաբուծաբանություն'
]],
            [1 => ['Ալերգոլոգիա և իմունոլոգիա', 'Հերիատրիա', 'Հոմեոպաթիա', 'Սեռախտաբանություն', 'Երիկամաբանություն և հեմոդիալիզ', 'Աղեստամոքսաբանություն', 'Ռևմատոլոգիա']],
            [2 => ['Վիրաբուժական ստոմատոլոգիա և իմպլանտոլոգիա', 'Օրթոդոնտիա', 'Օրթոպեդիկ ստոմատոլոգիա', 'Մանկական ստոմատոլոգիա']],
            [3 => ['Ընդհանուր դեղագիտություն','Դեղագործության կազմակերպում և կառավարում','Դեղաձևերի տեխնոլոգիա','Դեղագործական քիմիա և ֆարմակոգնոզիա','Կլինիկական դեղագիտություն (ֆարմացիա)'
]],
            [4 => ['Առողջապահության կառավարում և կազմակերպում', 'Շրջակա միջավայրի հիգիենա', 'Համաճարակաբանություն', 'Մանրէաբանություն']]
        ];

        foreach ($spec as $key => $value) {

            foreach ($value as $i => $items) {
                foreach ($items as $it) {
                    $item = ['parent_id' => $key + 1,
                        'type_id' => $i,
                        'name' => $it,
                        'icon' => 'fa ',
                        'created_at' => Carbon::now(),
                        'updated_at' => Carbon::now(),];
                    Facades\DB::table('specialties')->insert($item);
                }
            }

        }
    }
}
